apache/nuttx/arch/xtensa/src/esp32/esp32_wtd.c
/****************************************************************************
 * arch/xtensa/src/esp32/esp32_wtd.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/
#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <stdbool.h>
#include "xtensa.h"
#include "hardware/esp32_tim.h"
#include "hardware/esp32_rtccntl.h"
#include "esp32_wtd.h"
#include "esp32_cpuint.h"
#include "esp32_rtc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Helpers for converting from Q13.19 fixed-point format to float */

#define N 19
#define Q_TO_FLOAT(x) ((float)x/(float)(1<<N))

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct esp32_wtd_priv_s
  {
    FAR struct esp32_wtd_ops_s *ops;
    uint32_t                    base;    /* WTD register base address */
    uint8_t                     periph;  /* Peripheral ID */
    uint8_t                     irq;     /* Interrupt ID */
    int                         cpuint;  /* CPU interrupt assigned to this wtd */
    bool                        inuse;   /* Flag indicating if this wtd is in use */
  };

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* WTD registers access *****************************************************/

static void esp32_wtd_putreg(FAR struct esp32_wtd_dev_s *dev,
                             uint32_t offset,
                             uint32_t value);
static void esp32_wtd_modifyreg32(FAR struct esp32_wtd_dev_s *dev,
                                  uint32_t offset,
                                  uint32_t clearbits,
                                  uint32_t setbits);
static uint32_t esp32_wtd_getreg(FAR struct esp32_wtd_dev_s *dev,
                                 uint32_t offset);

/* WTD operations ***********************************************************/

static int esp32_wtd_start(FAR struct esp32_wtd_dev_s *dev);
static int esp32_wtd_stop(FAR struct esp32_wtd_dev_s *dev);
static int esp32_wtd_enablewp(FAR struct esp32_wtd_dev_s *dev);
static int esp32_wtd_disablewp(FAR struct esp32_wtd_dev_s *dev);
static int esp32_wtd_pre(FAR struct esp32_wtd_dev_s *dev, uint16_t value);
static int esp32_wtd_settimeout(FAR struct esp32_wtd_dev_s *dev,
                                uint32_t value, uint8_t stage);
static int esp32_wtd_feed_dog(FAR struct esp32_wtd_dev_s *dev);
static int esp32_wtd_set_stg_conf(FAR struct esp32_wtd_dev_s *dev,
                                   uint8_t stage, uint8_t conf);
static uint16_t esp32_rtc_clk(FAR struct esp32_wtd_dev_s *dev);
static int esp32_wtd_setisr(FAR struct esp32_wtd_dev_s *dev, xcpt_t handler,
                            FAR void * arg);
static int esp32_wtd_enableint(FAR struct esp32_wtd_dev_s *dev);
static int esp32_wtd_disableint(FAR struct esp32_wtd_dev_s *dev);
static int esp32_wtd_ackint(FAR struct esp32_wtd_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* ESP32 WTD ops */

struct esp32_wtd_ops_s esp32_mwtd_ops =
{
  .start         = esp32_wtd_start,
  .stop          = esp32_wtd_stop,
  .enablewp      = esp32_wtd_enablewp,
  .disablewp     = esp32_wtd_disablewp,
  .pre           = esp32_wtd_pre,
  .settimeout    = esp32_wtd_settimeout,
  .feed          = esp32_wtd_feed_dog,
  .stg_conf      = esp32_wtd_set_stg_conf,
  .rtc_clk       = NULL,
  .setisr        = esp32_wtd_setisr,
  .enableint     = esp32_wtd_enableint,
  .disableint    = esp32_wtd_disableint,
  .ackint        = esp32_wtd_ackint,
};

struct esp32_wtd_ops_s esp32_rwtd_ops =
{
  .start         = esp32_wtd_start,
  .stop          = esp32_wtd_stop,
  .enablewp      = esp32_wtd_enablewp,
  .disablewp     = esp32_wtd_disablewp,
  .pre           = NULL,
  .settimeout    = esp32_wtd_settimeout,
  .feed          = esp32_wtd_feed_dog,
  .stg_conf      = esp32_wtd_set_stg_conf,
  .rtc_clk       = esp32_rtc_clk,
  .setisr        = esp32_wtd_setisr,
  .enableint     = esp32_wtd_enableint,
  .disableint    = esp32_wtd_disableint,
  .ackint        = esp32_wtd_ackint,
};

#ifdef CONFIG_ESP32_MWDT0

struct esp32_wtd_priv_s g_esp32_mwtd0_priv =
{
  .ops    = &esp32_mwtd_ops,
  .base   = TIMG_WDTCONFIG0_REG(0),
  .periph = ESP32_PERIPH_TG_WDT_LEVEL, /* Peripheral ID */
  .irq    = ESP32_IRQ_TG_WDT_LEVEL,    /* Interrupt ID */
  .cpuint = -ENOMEM,                   /* CPU interrupt assigned to this wtd */
  .inuse = false,
};
#endif

#ifdef CONFIG_ESP32_MWDT1

struct esp32_wtd_priv_s g_esp32_mwtd1_priv =
{
  .ops   = &esp32_mwtd_ops,
  .base  = TIMG_WDTCONFIG0_REG(1),
  .periph = ESP32_PERIPH_TG1_WDT_LEVEL, /* Peripheral ID */
  .irq    = ESP32_IRQ_TG1_WDT_LEVEL,    /* Interrupt ID */
  .cpuint = -ENOMEM,                    /* CPU interrupt assigned to this wtd */
  .inuse = false,
};
#endif

