apache/nuttx/arch/xtensa/src/esp32/esp32_wtd.c
  /* If it is a MWDT */

  else
    {
      esp32_wtd_putreg(dev, MWDT_FEED_OFFSET , FEED_DOG);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32_wtd_setisr
 *
 * Description:
 *   Allocates a Level CPU Interrupt, connects the peripheral source to this
 *   Interrupt, register the callback and enables the Interruption. It does
 *   the opposite if the handler and arg are NULL.
 *
 ****************************************************************************/

static int esp32_wtd_setisr(FAR struct esp32_wtd_dev_s *dev, xcpt_t handler,
                            FAR void *arg)
{
  FAR struct esp32_wtd_priv_s *wtd = NULL;
  int ret = OK;
  uint8_t cpu;

  DEBUGASSERT(dev);

  wtd = (FAR struct esp32_wtd_priv_s *)dev;

  /* Disable interrupt when callback is removed */

  if (handler == NULL)
    {
      /* If a CPU Interrupt was previously allocated, then deallocate it */

      if (wtd->cpuint >= 0)
        {
          /* Disable CPU Interrupt, free a previously allocated
           * CPU Interrupt
           */

          up_disable_irq(wtd->cpuint);
          cpu = up_cpu_index();
          esp32_detach_peripheral(cpu, wtd->periph, wtd->cpuint);
          esp32_free_cpuint(wtd->cpuint);
          irq_detach(wtd->irq);
        }

      ret = OK;
      goto errout;
    }

  /* Otherwise set callback and enable interrupt */

  else
    {
      /* Verify the available CPU Interrupt */

      wtd->cpuint = esp32_alloc_levelint(1);
      if (wtd->cpuint < 0)
        {
          tmrerr("ERROR: No CPU Interrupt available");
          ret = wtd->cpuint;
          goto errout;
        }

      /* Disable the provided CPU Interrupt to configure it */

      up_disable_irq(wtd->cpuint);

      /* Attach a peripheral interrupt to the available CPU interrupt in
       * the current core
       */

      cpu = up_cpu_index();
      esp32_attach_peripheral(cpu, wtd->periph, wtd->cpuint);

      /* Associate an IRQ Number (from the WDT) to an ISR */

      ret = irq_attach(wtd->irq, handler, arg);

      if (ret != OK)
        {
          esp32_detach_peripheral(cpu, wtd->periph, wtd->cpuint);
          esp32_free_cpuint(wtd->cpuint);
          tmrerr("ERROR: Failed to associate an IRQ Number");
          goto errout;
        }

      /* Enable the CPU Interrupt that is linked to the wdt */

      up_enable_irq(wtd->cpuint);
    }

errout:
  return ret;
}

/****************************************************************************
 * Name: esp32_wtd_enableint
 *
 * Description:
 *   Enables a Level Interrupt at timeout.
 *
 ****************************************************************************/

static int esp32_wtd_enableint(FAR struct esp32_wtd_dev_s *dev)
{
  DEBUGASSERT(dev);

  /* Set the level interrupt bit */

  /* If it is a RWDT */

  if (((struct esp32_wtd_priv_s *)dev)->base == RTC_CNTL_OPTIONS0_REG)
    {
      /* Level Interrupt */

      esp32_wtd_modifyreg32(dev, RWDT_CONFIG0_OFFSET, 0,
                            RTC_CNTL_WDT_LEVEL_INT_EN);

      /* Enable Interrupt */

      esp32_wtd_modifyreg32(dev, RWDT_INT_ENA_REG_OFFSET, 0,
                            RTC_CNTL_WDT_INT_ENA);
    }

  /* If it is a MWDT */

  else
    {
      /* Level Interrupt */

      esp32_wtd_modifyreg32(dev, MWDT_CONFIG0_OFFSET, 0,
                            TIMG_WDT_LEVEL_INT_EN);

      /* Enable Interrupt */

      esp32_wtd_modifyreg32(dev, MWDT_INT_ENA_REG_OFFSET, 0,
                            TIMG_WDT_INT_ENA);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32_wtd_disableint
 *
 * Description:
 *   Disables a Level Interrupt at timeout.
 *
 ****************************************************************************/

static int esp32_wtd_disableint(FAR struct esp32_wtd_dev_s *dev)
{
  DEBUGASSERT(dev);

  /* If it is a RWDT */

  if (((struct esp32_wtd_priv_s *)dev)->base == RTC_CNTL_OPTIONS0_REG)
    {
      /* Level Interrupt */

      esp32_wtd_modifyreg32(dev, RWDT_CONFIG0_OFFSET,
                            RTC_CNTL_WDT_LEVEL_INT_EN, 0);

      /* Enable Interrupt */

      esp32_wtd_modifyreg32(dev, RWDT_INT_ENA_REG_OFFSET,
                            RTC_CNTL_WDT_INT_ENA, 0);
    }

  /* If it is a MWDT */

  else
    {
      /* Level Interrupt */

      esp32_wtd_modifyreg32(dev, MWDT_CONFIG0_OFFSET,
                            TIMG_WDT_LEVEL_INT_EN, 0);

      /* Enable Interrupt */

      esp32_wtd_modifyreg32(dev, MWDT_INT_ENA_REG_OFFSET,
                            TIMG_WDT_INT_ENA, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32_wtd_ackint
 *
 *   Description:
 *   Acknowledges an interrupt
 *
 ****************************************************************************/

static int esp32_wtd_ackint(FAR struct esp32_wtd_dev_s *dev)
{
  DEBUGASSERT(dev);

  /* If it is a RWDT */

  if (((struct esp32_wtd_priv_s *)dev)->base == RTC_CNTL_OPTIONS0_REG)
    {
      esp32_wtd_putreg(dev, RWDT_INT_CLR_REG_OFFSET, RTC_CNTL_WDT_INT_CLR);
    }

  /* If it is a MWDT */

  else
    {
      esp32_wtd_putreg(dev, MWDT_INT_CLR_REG_OFFSET, TIMG_WDT_INT_CLR);
    }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32_wtd_init
 *
 * Description:
 *   Initialize WDT device
 *
 ****************************************************************************/

FAR struct esp32_wtd_dev_s *esp32_wtd_init(uint8_t wdt_id)
{
  FAR struct esp32_wtd_priv_s *wtd = NULL;

  /* Get wdt instance */

  switch (wdt_id)
    {
#ifdef CONFIG_ESP32_MWDT0
      case 0:
        {
          wtd = &g_esp32_mwtd0_priv;
          break;
        }

#endif
#ifdef CONFIG_ESP32_MWDT1
      case 1:
        {
          wtd = &g_esp32_mwtd1_priv;
          break;
        }

#endif
#ifdef CONFIG_ESP32_RWDT
      case 2:
        {
          wtd = &g_esp32_rwtd_priv;
          break;
        }

#endif
      default:
        {
          tmrerr("ERROR: unsupported WDT %d\n", wdt_id);
          goto errout;
        }
    }

  /* If some code is using it then sends an error message,
   * Otherwise, inform it has been used.
   */

  if (wtd->inuse == true)
    {
      tmrerr("ERROR: WDT %d is already in use\n", wdt_id);
      wtd = NULL;
    }
  else
    {
      wtd->inuse = true;
    }

  errout:
    return (FAR struct esp32_wtd_dev_s *)wtd;
}

/****************************************************************************
 * Name: esp32_wtd_deinit
 *
 * Description:
 *   Deinit WDT device
 *
 ****************************************************************************/

int esp32_wtd_deinit(FAR struct esp32_wtd_dev_s *dev)
{
  FAR struct esp32_wtd_priv_s *wtd = NULL;

  DEBUGASSERT(dev);

  wtd = (FAR struct esp32_wtd_priv_s *)dev;

  wtd->inuse = false;

  return OK;
}

/****************************************************************************
 * Name: esp32_wtd_is_running
 *
 * Description:
 *   Checks if the wdt was already turned on. For example, RTC may has been
 *   enabled in bootloader.
 *
 ****************************************************************************/

bool esp32_wtd_is_running(FAR struct esp32_wtd_dev_s *dev)
{
  uint32_t status = 0;
  DEBUGASSERT(dev);

  /* If it is a RWDT */

  if (((struct esp32_wtd_priv_s *)dev)->base ==
        RTC_CNTL_OPTIONS0_REG)
    {
      status = esp32_wtd_getreg(dev, RWDT_CONFIG0_OFFSET);
      if (status & RTC_CNTL_WDT_EN)
        {
          return true;
        }
    }

  /* If it is a MWDT */

  else
    {
      status = esp32_wtd_getreg(dev, MWDT_CONFIG0_OFFSET);
      if (status & TIMG_WDT_EN)
        {
          return true;
        }
    }

  return false;
}
